hVar.tab_rankboard_prize = {}
local _tab_rankboard_prize = hVar.tab_rankboard_prize

--随机迷宫每日排名奖励
_tab_rankboard_prize[1] = {
	--开放条件
	--[[
	open_condition =
	{
		--当前为第n周，n除以除数，得出余数，余数等于指定的值，本周才开放
		week_begin = "2018-09-10 00:00:00", --以此日期作为第1周
		week_divisor = 2, --除数
		week_module = 1, --模数
	},
	]]
	
	max_rank = 100,
	
	[1] = { --周一（复活延长）
		lv_hero = -1,
		lv_tower = -1,			--限制我方塔等级
		lv_tactic = -1,			--限制我方战术卡等级
		ban_hero = {},			--禁用的英雄
		ban_tower = {},	--禁用的塔
		ban_tactic = {1039,1077,1078,1097,1083,},	--禁用的战术卡
		diff_tactic = {{1203,1,},},	--给敌人加BUFF
		reward = 
		{
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
	[2] = { --周二（每秒扣血）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {18001,18005,18014,18027,18024,},
		ban_tower = {1022,},
		ban_tactic = {1005,1098,1086,},
		diff_tactic = {{1204,1,},},
		reward = 
		{
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
	[3] = { --周3（攻击丢失+怪血厚）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {},
		ban_tactic = {1031,1247,},
		diff_tactic = {{1207,1,},},
		reward = 
		{
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
	[4] = { --周四（怪跑快）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {1011,1015,1016,1012,1023,},
		ban_tactic = {1077,},
		diff_tactic = {{1204,1,},},
		reward = 
		{
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
	[5] = { --周五（冷却变长）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {18024,18019,},
		ban_tower = {},
		ban_tactic = {1042,},
		diff_tactic = {{1207,1,},},
		reward = 
		{
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
	[6] = { --周六（怪弱控）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {},
		ban_tactic = {},
		diff_tactic = {{1208,1,},},
		reward = 
		{
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
	[7] = { --周日（怪攻击高，我方血低）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {},
		ban_tactic = {1032,},
		diff_tactic = {{1209,1,},},
		reward = {
			{from = 1,to = 1,{108,100,},{7,50,},},
			{from = 2,to = 3,{108,80,},{7,40,},},
			{from = 4,to = 10,{108,60,},{7,30,},},
			{from = 11,to = 20,{108,40,},{7,20,},},
			{from = 21,to = 50,{108,20,},{7,10,},},
			{from = 51,to = 100,{108,10,},{7,5,},},
		},
	},
}

--前哨阵低每日排名奖励
_tab_rankboard_prize[2] = {
	--开放条件
	--[[
	open_condition =
	{
		--当前为第n周，n除以除数，得出余数，余数等于指定的值，本周才开放
		week_begin = "2018-09-10 00:00:00", --以此日期作为第1周
		week_divisor = 2, --除数
		week_module = 1, --模数
	},
	]]
	
	max_rank = 100,
	
	[1] = { --周一（复活延长）
		lv_hero = -1,
		lv_tower = -1,			--限制我方塔等级
		lv_tactic = -1,			--限制我方战术卡等级
		ban_hero = {},			--禁用的英雄
		ban_tower = {},	--禁用的塔
		ban_tactic = {1039,1077,1078,1097,1083,},	--禁用的战术卡
		diff_tactic = {{1203,1,},},	--给敌人加BUFF
		reward = 
		{
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
	[2] = { --周二（每秒扣血）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {18001,18005,18014,18027,18024,},
		ban_tower = {1022,},
		ban_tactic = {1005,1098,1086,},
		diff_tactic = {{1204,1,},},
		reward = 
		{
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
	[3] = { --周3（攻击丢失+怪血厚）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {},
		ban_tactic = {1031,1247,},
		diff_tactic = {{1205,1,},},
		reward = 
		{
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
	[4] = { --周四（怪跑快）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {1011,1015,1016,1012,1023,},
		ban_tactic = {1077,},
		diff_tactic = {{1206,1,},},
		reward = 
		{
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
	[5] = { --周五（冷却变长）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {18024,18019,},
		ban_tower = {},
		ban_tactic = {1042,},
		diff_tactic = {{1207,1,},},
		reward = 
		{
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
	[6] = { --周六（怪弱控）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {},
		ban_tactic = {},
		diff_tactic = {{1208,1,},},
		reward = 
		{
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
	[7] = { --周日（怪攻击高，我方血低）
		lv_hero = -1,
		lv_tower = -1,
		lv_tactic = -1,
		ban_hero = {},
		ban_tower = {},
		ban_tactic = {1032,},
		diff_tactic = {{1209,1,},},
		reward = {
			{from = 1,to = 1,{106,100},{7,50,},},
			{from = 2,to = 3,{106,80},{7,40,},},
			{from = 4,to = 10,{106,60},{7,30,},},
			{from = 11,to = 20,{106,40},{7,20,},},
			{from = 21,to = 50,{106,20},{7,10,},},
			{from = 51,to = 100,{106,10},{7,5,},},
		},
	},
}
