hVar.tab_droppool = {}

local _tab_droppool = hVar.tab_droppool

--金币奖池
_tab_droppool["Gold_Free"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 50, reward = {7,0}},		--7: 金币
	{value = 30, reward = {7,1}},		--7: 金币
	{value = 15, reward = {7,2}},		--7: 金币
	{value = 5, reward = {7,3}},		--7: 金币
}

_tab_droppool["Gold_Small"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 40, reward = {7,1}},		--7: 金币
	{value = 25, reward = {7,2}},		--7: 金币
	{value = 20, reward = {7,3}},		--7: 金币
	{value = 15, reward = {7,5}},		--7: 金币
}

_tab_droppool["Gold_Big"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 30, reward = {7,1}},		--7: 金币
	{value = 25, reward = {7,2}},		--7: 金币
	{value = 20, reward = {7,3}},		--7: 金币
	{value = 15, reward = {7,5}},		--7: 金币
	{value = 10, reward = {7,8}},		--7: 金币
}

--兵种碎片奖池
--普通兵种
_tab_droppool["Amy_Nommal"] = {
	totalValue = 126,			--总权重(后续所有权重和一定要等于总权重)
	{value = 2, reward = {6,10507}},	--6: 象兵
	{value = 2, reward = {6,10509}},	--6: 虎豹骑
	{value = 2, reward = {6,10512}},	--6: 爆炎
	{value = 10, reward = {6,10501}},	--6: 孔明灯
	{value = 10, reward = {6,10502}},	--6: 死士
	{value = 10, reward = {6,10503}},	--6: 投石车
	{value = 10, reward = {6,10504}},	--6: 力士
	{value = 10, reward = {6,10505}},	--6: 自爆兵
	{value = 10, reward = {6,10506}},	--6: 箭雨
	{value = 10, reward = {6,10508}},	--6: 护城弩手
	{value = 10, reward = {6,10513}},	--6: 护城卫士
	{value = 10, reward = {6,10514}},	--6: 狗雨
	{value = 10, reward = {6,10515}},	--6: 表情力士
	{value = 10, reward = {6,10517}},	--6: 天网
	{value = 10, reward = {6,10518}},	--6: 捕兽夹
}

--高级兵种
_tab_droppool["Amy_Rare"] = {
	totalValue = 59,			--总权重(后续所有权重和一定要等于总权重)
	{value = 2, reward = {5,10201}},	--5: 英雄将魂 刘备
	{value = 2, reward = {5,10202}},	--5: 英雄将魂 关羽
	{value = 2, reward = {5,10203}},	--5: 英雄将魂 张飞
	{value = 1, reward = {5,10208}},	--5: 英雄将魂 赵云
	{value = 1, reward = {5,10205}},	--5: 英雄将魂 曹操
	{value = 1, reward = {5,10210}},	--5: 英雄将魂 夏侯惇
	{value = 1, reward = {5,10207}},	--5: 英雄将魂 郭嘉
	{value = 1, reward = {5,10206}},	--5: 英雄将魂 太史慈
	{value = 1, reward = {5,10211}},	--5: 英雄将魂 吕布
	{value = 1, reward = {5,10212}},	--5: 英雄将魂 貂蝉
	{value = 1, reward = {5,10214}},	--5: 英雄将魂 张辽
	{value = 1, reward = {5,10216}},	--5: 英雄将魂 典韦
	{value = 1, reward = {5,10215}},	--5: 英雄将魂 许褚
	{value = 1, reward = {5,10225}},	--5: 英雄将魂 荀彧
	{value = 1, reward = {5,10218}},	--5: 英雄将魂 孙策
	{value = 1, reward = {5,10219}},	--5: 英雄将魂 周瑜
	--{value = 1, reward = {5,10222}},	--5: 英雄将魂 小乔（VIP6）
	{value = 1, reward = {5,10220}},	--5: 英雄将魂 徐庶
	{value = 1, reward = {5,10221}},	--5: 英雄将魂 诸葛亮
	{value = 1, reward = {5,10226}},	--5: 英雄将魂 黄月英
	--{value = 1, reward = {5,10217}},	--5: 英雄将魂 甘宁
	{value = 1, reward = {5,10223}},	--5: 英雄将魂 孙权
	{value = 1, reward = {5,10224}},	--5: 英雄将魂 庞统
	{value = 1, reward = {5,10227}},	--5: 英雄将魂 贾诩
	{value = 1, reward = {5,10228}},	--5: 英雄将魂 孙尚香
	{value = 11, reward = {6,10507}},	--6: 象兵
	{value = 11, reward = {6,10509}},	--6: 虎豹骑
	{value = 11, reward = {6,10512}},	--6: 爆炎
}

--英雄将魂碎片奖池
--免费锦囊
_tab_droppool["Hero_Free"] = {
	totalValue = 140,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {5,10201}},	--5: 英雄将魂 刘备
	{value = 10, reward = {5,10202}},	--5: 英雄将魂 关羽
	{value = 10, reward = {5,10203}},	--5: 英雄将魂 张飞
	{value = 5, reward = {5,10208}},	--5: 英雄将魂 赵云
	{value = 5, reward = {5,10205}},	--5: 英雄将魂 曹操
	{value = 5, reward = {5,10210}},	--5: 英雄将魂 夏侯惇
	{value = 5, reward = {5,10207}},	--5: 英雄将魂 郭嘉
	{value = 5, reward = {5,10206}},	--5: 英雄将魂 太史慈
	{value = 5, reward = {5,10211}},	--5: 英雄将魂 吕布
	{value = 5, reward = {5,10212}},	--5: 英雄将魂 貂蝉
	{value = 10, reward = {5,10214}},	--5: 英雄将魂 张辽
	{value = 5, reward = {5,10216}},	--5: 英雄将魂 典韦
	{value = 10, reward = {5,10215}},	--5: 英雄将魂 许褚
	{value = 5, reward = {5,10225}},	--5: 英雄将魂 荀彧
	{value = 5, reward = {5,10218}},	--5: 英雄将魂 孙策
	{value = 5, reward = {5,10219}},	--5: 英雄将魂 周瑜
	--{value = 5, reward = {5,10222}},	--5: 英雄将魂 小乔（VIP6）
	{value = 5, reward = {5,10220}},	--5: 英雄将魂 徐庶
	{value = 5, reward = {5,10221}},	--5: 英雄将魂 诸葛亮
	{value = 5, reward = {5,10226}},	--5: 英雄将魂 黄月英
	--{value = 15, reward = {5,10217}},	--5: 英雄将魂 甘宁
	{value = 5, reward = {5,10223}},	--5: 英雄将魂 孙权
	{value = 5, reward = {5,10224}},	--5: 英雄将魂 庞统
	{value = 5, reward = {5,10227}},	--5: 英雄将魂 贾诩
	{value = 5, reward = {5,10228}},	--5: 英雄将魂 孙尚香
}

--其他锦囊掉
_tab_droppool["Hero_Normal"] = {
	totalValue = 155,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {5,10201}},	--5: 英雄将魂 刘备
	{value = 10, reward = {5,10202}},	--5: 英雄将魂 关羽
	{value = 10, reward = {5,10203}},	--5: 英雄将魂 张飞
	{value = 5, reward = {5,10208}},	--5: 英雄将魂 赵云
	{value = 5, reward = {5,10205}},	--5: 英雄将魂 曹操
	{value = 5, reward = {5,10210}},	--5: 英雄将魂 夏侯惇
	{value = 5, reward = {5,10207}},	--5: 英雄将魂 郭嘉
	{value = 5, reward = {5,10206}},	--5: 英雄将魂 太史慈
	{value = 5, reward = {5,10211}},	--5: 英雄将魂 吕布
	{value = 5, reward = {5,10212}},	--5: 英雄将魂 貂蝉
	{value = 10, reward = {5,10214}},	--5: 英雄将魂 张辽
	{value = 5, reward = {5,10216}},	--5: 英雄将魂 典韦
	{value = 10, reward = {5,10215}},	--5: 英雄将魂 许褚
	{value = 5, reward = {5,10225}},	--5: 英雄将魂 荀彧
	{value = 5, reward = {5,10218}},	--5: 英雄将魂 孙策
	{value = 5, reward = {5,10219}},	--5: 英雄将魂 周瑜
	--{value = 5, reward = {5,10222}},	--5: 英雄将魂 小乔（VIP6）
	{value = 5, reward = {5,10220}},	--5: 英雄将魂 徐庶
	{value = 5, reward = {5,10221}},	--5: 英雄将魂 诸葛亮
	{value = 5, reward = {5,10226}},	--5: 英雄将魂 黄月英
	{value = 15, reward = {5,10217}},	--5: 英雄将魂 甘宁
	{value = 5, reward = {5,10223}},	--5: 英雄将魂 孙权
	{value = 5, reward = {5,10224}},	--5: 英雄将魂 庞统
	{value = 5, reward = {5,10227}},	--5: 英雄将魂 贾诩
	{value = 5, reward = {5,10228}},	--5: 英雄将魂 孙尚香
}

--神器晶石抽奖池
--积分组合
_tab_droppool["Score_Free"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {1,10}},		--1: 积分
	{value = 25, reward = {1,15}},		--1: 积分
	{value = 40, reward = {1,20}},		--1: 积分
	{value = 15, reward = {1,30}},		--1: 积分
	{value = 10, reward = {1,40}},		--1: 积分
}

--蓝装
_tab_droppool["Equip_Blue"] = {
	totalValue = 28,			--总权重(后续所有权重和一定要等于总权重)
	{value = 1,reward = {3,11023}},		--3：朴刀 （类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11115}},		--3：护手 （类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11012}},		--3：青铜双剑（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11018}},		--3：三丈矛（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11071}},		--3：钩镰刀（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11038}},		--3：镔铁枪（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11047}},		--3：镔铁戟（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11037}},		--3：镔铁刀（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11024}},		--3：大砍刀（类型3是普通道具，客户端计算）
	
	{value = 1,reward = {3,11116}},		--3：夜行衣 （类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11029}},		--3：青铜重甲（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11041}},		--3：镔铁甲（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11014}},		--3：木棉布衣（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11072}},		--3：铁索甲（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11053}},		--3：培元甲（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11020}},		--3：镶钉皮甲（类型3是普通道具，客户端计算）
	
	{value = 1,reward = {3,11045}},		--3：刺客面具 （类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11016}},		--3：乌拉草靴（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11022}},		--3：绮罗香囊（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11032}},		--3：狼牙项链（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11117}},		--3：护心镜（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11073}},		--3：血精石（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11051}},		--3：爆弹护腕（类型3是普通道具，客户端计算）
	
	{value = 1,reward = {3,11118}},		--3：吐谷浑马 （类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11035}},		--3：乌丸马（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11074}},		--3：大郦马（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11049}},		--3：大宛马（类型3是普通道具，客户端计算）
	{value = 1,reward = {3,11043}},		--3：西凉马（类型3是普通道具，客户端计算）
}

--黄装
_tab_droppool["Equip_Yellow"] = {
	totalValue = 46,				--总权重(后续所有权重和一定要等于总权重)
	{value = 1, reward = {3,11075}},	--3: 鬼头刀（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11039}},	--3: 凤嘴刀（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11027}},	--3: 蛇矛（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11040}},	--3: 狼牙枪（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11025}},	--3: 双股剑（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11062}},	--3: 巨木棍（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11059}},	--3: 三尖刀（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11057}},	--3: 相思环（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11113}},	--3: 神木剑（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11048}},	--3: 方天戟（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11066}},	--3: 黄龙钩镰刀（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11076}},	--3: 碎金棒（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11067}},	--3: 玄铁重锤（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11026}},	--3: 偃月刀（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11063}},	--3: 寒铁巨棍（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11109}},	--3: 火精剑（类型3是普通道具，客户端计算）
	--{value = 1, reward = {3,11091}},	--3: 吸血刺（类型3是普通道具，客户端计算）
	--{value = 1, reward = {3,11094}},	--3: 破岩锤（类型3是普通道具，客户端计算）
	
	{value = 1, reward = {3,11110}},	--3: 百战铠甲（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11077}},	--3: 疾风衣（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11058}},	--3: 霓裳羽衣（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11068}},	--3: 黄金锁子甲（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11061}},	--3: 忠义袍（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11030}},	--3: 青铜重铠（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11054}},	--3: 擎天甲（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11042}},	--3: 玄铁甲（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11092}},	--3: 道士法衣（类型3是普通道具，客户端计算）
	--{value = 1, reward = {3,11104}},	--3: 紫铜战甲（类型3是普通道具，客户端计算）
	
	{value = 1, reward = {3,11114}},	--3: 百草香囊（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11111}},	--3: 大战鼓（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11052}},	--3: 爆炎护腕（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11046}},	--3: 赤红面具（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11069}},	--3: 赤血晶石（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11064}},	--3: 火焰指环（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11078}},	--3: 狮头盔（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11079}},	--3: 白银护心镜（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11033}},	--3: 祸斗项链（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11088}},	--3: 木灵珠（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11093}},	--3: 苍蓝晶石（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11065}},	--3: 炎雀指环（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11105}},	--3: 玄铁圆盾（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11060}},	--3: 赤金护腕（类型3是普通道具，客户端计算）
	--{value = 1, reward = {3,11090}},	--3: 铸铜战盔（类型3是普通道具，客户端计算）
	
	{value = 1, reward = {3,11080}},	--3: 飞电（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11070}},	--3: 燎原火（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11112}},	--3: 北风（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11044}},	--3: 沙里飞（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11036}},	--3: 黑王（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11050}},	--3: 汗血马（类型3是普通道具，客户端计算）
	--{value = 1, reward = {3,11089}},	--3: 毒王（类型3是普通道具，客户端计算）
	{value = 1, reward = {3,11103}},	--3: 乌雅（类型3是普通道具，客户端计算）
}

--红装 神器锦囊
_tab_droppool["Equip_Red"] = {
	totalValue = 28,			--总权重(后续所有权重和一定要等于总权重) 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12202,-1}},	--10: 炽魂战衣（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12203,-1}},	--10: 玄冰魔衣（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12204,-1}},	--10: 饕餮魔甲（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12401,-1}},	--10: 文王八卦镜（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12402,-1}},	--10: 孟德新书（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12403,-1}},	--10: 摸金手套（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12601,-1}},	--10: 蛮王战象（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12602,-1}},	--10: 绝影（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12603,-1}},	--10: 的卢（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12001,-1}},	--10: 鬼神方天戟（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12002,-1}},	--10: 朱雀羽扇（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12004,-1}},	--10: 倚天剑（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12005,-1}},	--10: 冥蛇弩（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12201,-1}},	--10: 玄武战甲（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	
	---新增红装
	{value = 1, reward = {10,12404,-1}},	--10: 殇王之盔（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12604,-1}},	--10: 盗骊（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12405,-1}},	--10: 神鹰令（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	
	{value = 1, reward = {10,12006,-1}},	--10: 恶鬼锤（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12407,-1}},	--10: 喋血护腕（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12605,-1}},	--10: 九色鹿（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12206,-1}},	--10: 黑暗魔衣（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12606,-1}},	--10: 游云惊帆（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	
	{value = 1, reward = {10,12207,-1}},	--10: 紫电神雷衣（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12408,-1}},	--10: 镇魂钟（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	
	{value = 1, reward = {10,12410,-1}},	--10: 太平清领道（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12009,-1}},	--10: 泰阿剑（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12208,-1}},	--10: 隐身斗篷（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 1, reward = {10,12608,-1}},	--10: 爪黄飞电（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
}


--魔龙副本掉落-新年活动-年兽
_tab_droppool["Boss_nianshou"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重) 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 8, reward = {10,12609,-1}},	--10: 年兽（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 42, reward = {11,50}},		--11: 晶石
	{value = 50, reward = {1,2000}},	--1: 积分
}


--魔龙副本掉落-献祭之石
_tab_droppool["Boss_001"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重) 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 10, reward = {10,12406,0}},	--10: 献祭之石（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 40, reward = {11,50}},		--11: 晶石
	{value = 50, reward = {1,2000}},	--1: 积分
}

--副本掉落-积分
_tab_droppool["Boss_002"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {1,800}},		--1: 积分
	{value = 15, reward = {1,850}},		--1: 积分
	{value = 25, reward = {1,900}},		--1: 积分
	{value = 25, reward = {1,950}},		--1: 积分
	{value = 25, reward = {1,1000}},	--1: 积分
}

--副本掉落-神器晶石
_tab_droppool["Boss_003"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {11,15}},		--11: 晶石
	{value = 30, reward = {11,20}},		--11: 晶石
	{value = 30, reward = {11,25}},		--11: 晶石
	{value = 30, reward = {11,30}},		--11: 晶石
}

--铜雀台副本掉落-献祭之石
_tab_droppool["Boss_004"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重) 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 10, reward = {10,12406,0}},	--10: 献祭之石（类型10是神装道具，服务器计算） 孔数(默认0):-1随机0孔1孔2孔3孔4孔
	{value = 40, reward = {11,35}},		--11: 晶石
	{value = 50, reward = {1,1500}},	--1: 积分
}


--竞技场-神器晶石
_tab_droppool["Ruby_001"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 40, reward = {11,2}},		--11: 晶石
	{value = 20, reward = {11,3}},		--11: 晶石
	{value = 20, reward = {11,4}},		--11: 晶石
	{value = 10, reward = {11,5}},		--11: 晶石
	{value = 10, reward = {11,6}},		--11: 晶石
}

--竞技场-神器晶石
_tab_droppool["Ruby_002"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 40, reward = {11,6}},		--11: 晶石
	{value = 20, reward = {11,7}},		--11: 晶石
	{value = 20, reward = {11,8}},		--11: 晶石
	{value = 10, reward = {11,9}},		--11: 晶石
	{value = 10, reward = {11,10}},		--11: 晶石
}

--武器枪碎片（普通）
_tab_droppool["Weapon_Normal"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {101,15001,1,}},	--101: 武器枪碎片 普通机枪碎片
	{value = 10, reward = {101,15002,1,}},	--101: 武器枪碎片 散弹枪碎片
	{value = 10, reward = {101,15003,1,}},	--101: 武器枪碎片 弹射枪碎片
	{value = 10, reward = {101,15004,1,}},	--101: 武器枪碎片 火焰枪碎片
	{value = 10, reward = {101,15005,1,}},	--101: 武器枪碎片 射线枪碎片
	{value = 10, reward = {101,15006,1,}},	--101: 武器枪碎片 闪电枪碎片
	{value = 10, reward = {101,15007,1,}},	--101: 武器枪碎片 毒液枪碎片
	{value = 10, reward = {101,15008,1,}},	--101: 武器枪碎片 缩小枪碎片
	{value = 10, reward = {101,15009,1,}},	--101: 武器枪碎片 镭射枪碎片
	{value = 10, reward = {101,15010,1,}},	--101: 武器枪碎片 冲击枪碎片
}

--[[
--武器枪碎片（高级）
_tab_droppool["Weapon_High"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	--{value = 20, reward = {101,15001,1,}},	--101: 武器枪碎片 普通机枪碎片
	--{value = 20, reward = {101,15002,1,}},	--101: 武器枪碎片 散弹枪碎片
	--{value = 20, reward = {101,15003,1,}},	--101: 武器枪碎片 弹射枪碎片
	{value = 40, reward = {101,15004,1,}},	--101: 武器枪碎片 火焰枪碎片
	{value = 20, reward = {101,15005,1,}},	--101: 武器枪碎片 射线枪碎片
	{value = 20, reward = {101,15006,1,}},	--101: 武器枪碎片 闪电枪碎片
	{value = 5, reward = {101,15007,1,}},	--101: 武器枪碎片 毒液枪碎片
	{value = 5, reward = {101,15008,1,}},	--101: 武器枪碎片 缩小枪碎片
	{value = 5, reward = {101,15009,1,}},	--101: 武器枪碎片 镭射枪碎片
	{value = 5, reward = {101,15010,1,}},	--101: 武器枪碎片 冲击枪碎片
}
]]

--战术卡碎片（普通）
_tab_droppool["Tactic_Normal"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 5, reward = {6,15201,1,}},	--6: 战术卡碎片 核爆碎片
	{value = 10, reward = {6,15202,1,}},	--6: 战术卡碎片 召唤机枪塔碎片
	{value = 10, reward = {6,15203,1,}},	--6: 战术卡碎片 召唤导弹塔碎片
	{value = 5, reward = {6,15204,1,}},	--6: 战术卡碎片 追踪导弹碎片
	{value = 5, reward = {6,15205,1,}},	--6: 战术卡碎片 护盾碎片
	{value = 10, reward = {6,15206,1,}},	--6: 战术卡碎片 十字炸弹碎片
	{value = 10, reward = {6,15207,1,}},	--6: 战术卡碎片 卫星炮碎片
	{value = 10, reward = {6,15208,1,}},	--6: 战术卡碎片 缩小碎片
	{value = 5, reward = {6,15209,1,}},	--6: 战术卡碎片 延时炸弹碎片
	{value = 5, reward = {6,15210,1,}},	--6: 战术卡碎片 冰冻碎片
	{value = 5, reward = {6,15211,1,}},	--6: 战术卡碎片 弹射球碎片
	{value = 10, reward = {6,15212,1,}},	--6: 战术卡碎片 黑洞碎片
	{value = 10, reward = {6,15213,1,}},	--6: 战术卡碎片 巨浪碎片
}

--[[
--战术卡碎片（普通）
_tab_droppool["Tactic_High"] = {
	totalValue = 95,			--总权重(后续所有权重和一定要等于总权重)
	{value = 5, reward = {6,15201,1,}},	--6: 战术卡碎片 核爆碎片
	{value = 5, reward = {6,15202,1,}},	--6: 战术卡碎片 召唤机枪塔碎片
	{value = 5, reward = {6,15203,1,}},	--6: 战术卡碎片 召唤导弹塔碎片
	{value = 5, reward = {6,15204,1,}},	--6: 战术卡碎片 追踪导弹碎片
	{value = 5, reward = {6,15205,1,}},	--6: 战术卡碎片 护盾碎片
	{value = 5, reward = {6,15206,1,}},	--6: 战术卡碎片 十字炸弹碎片
	{value = 5, reward = {6,15207,1,}},	--6: 战术卡碎片 卫星炮碎片
	{value = 10, reward = {6,15208,1,}},	--6: 战术卡碎片 缩小碎片
	{value = 10, reward = {6,15209,1,}},	--6: 战术卡碎片 延时炸弹碎片
	{value = 10, reward = {6,15210,1,}},	--6: 战术卡碎片 冰冻碎片
	{value = 10, reward = {6,15211,1,}},	--6: 战术卡碎片 弹射球碎片
	{value = 10, reward = {6,15212,1,}},	--6: 战术卡碎片 黑洞碎片
	{value = 10, reward = {6,15213,1,}},	--6: 战术卡碎片 巨浪碎片
}
]]


--宠物碎片（普通）
_tab_droppool["Pet_Normal"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 35, reward = {103,15101,1,}},	--103: 宠物碎片 瓦力宠物碎片
	{value = 35, reward = {103,15102,1,}},	--103: 宠物碎片 尤达宠物碎片
	{value = 15, reward = {103,15103,1,}},	--103: 宠物碎片 支援战机宠物碎片
	{value = 15, reward = {103,15104,1,}},	--103: 宠物碎片 刺蛇宝宝宠物碎片
}

--[[
--宠物碎片（高级）
_tab_droppool["Pet_High"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 30, reward = {103,15101,1,}},	--103: 宠物碎片 瓦力宠物碎片
	{value = 30, reward = {103,15102,1,}},	--103: 宠物碎片 尤达宠物碎片
	{value = 20, reward = {103,15103,1,}},	--103: 宠物碎片 支援战机宠物碎片
	{value = 20, reward = {103,15104,1,}},	--103: 宠物碎片 刺蛇宝宝宠物碎片
}
]]

--装备（普通1）
_tab_droppool["Equip_Normal"] = {
	totalValue = 143,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20101,0,}},	--3: 道具 水晶雷达Ⅰ
	{value = 10, reward = {10,20102,0,}},	--3: 道具 装填电机Ⅰ
	{value = 10, reward = {10,20103,0,}},	--3: 道具 刀片轮毂Ⅰ
	{value = 10, reward = {10,20104,0,}},	--3: 道具 反应装甲Ⅰ
	{value = 10, reward = {10,20105,0,}},	--3: 道具 涡轮引擎Ⅰ
	{value = 10, reward = {10,20106,0,}},	--3: 道具 合金装甲Ⅰ
	{value = 10, reward = {10,20107,0,}},	--3: 道具 防火装甲Ⅰ
	{value = 10, reward = {10,20108,0,}},	--3: 道具 防电装甲Ⅰ
	{value = 10, reward = {10,20109,0,}},	--3: 道具 防毒装甲Ⅰ
	{value = 10, reward = {10,20110,0,}},	--3: 道具 修理装置Ⅰ
	{value = 10, reward = {10,20211,0,}},	--3: 道具 输弹机Ⅰ
	{value = 3, reward = {10,20121,0,}},	
	{value = 3, reward = {10,20122,0,}},
	{value = 3, reward = {10,20123,0,}},
	{value = 3, reward = {10,20124,0,}},
	{value = 3, reward = {10,20125,0,}},
	{value = 3, reward = {10,20126,0,}},
	{value = 3, reward = {10,20127,0,}},
	{value = 3, reward = {10,20128,0,}},
	{value = 3, reward = {10,20129,0,}},
	{value = 3, reward = {10,20130,0,}},
	{value = 3, reward = {10,20131,0,}},
}

--装备（普通2）
_tab_droppool["Equip_Normal2"] = {
	totalValue = 128,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20201,0,}},	--3: 道具 水晶雷达Ⅱ
	{value = 10, reward = {10,20202,0,}},	--3: 道具 装填电机Ⅱ
	{value = 10, reward = {10,20203,0,}},	--3: 道具 刀片轮毂Ⅱ
	{value = 10, reward = {10,20204,0,}},	--3: 道具 反应装甲Ⅱ
	{value = 10, reward = {10,20205,0,}},	--3: 道具 涡轮引擎Ⅱ
	{value = 10, reward = {10,20206,0,}},	--3: 道具 合金装甲Ⅱ
	{value = 10, reward = {10,20207,0,}},	--3: 道具 防火装甲Ⅱ
	{value = 10, reward = {10,20208,0,}},	--3: 道具 防电装甲Ⅱ
	{value = 10, reward = {10,20209,0,}},	--3: 道具 防毒装甲Ⅱ
	{value = 10, reward = {10,20210,0,}},	--3: 道具 修理装置Ⅱ
	{value = 10, reward = {10,20211,0,}},	--3: 道具 输弹机Ⅱ
	{value = 3, reward = {10,20214,0,}},	--3: 道具 
	{value = 3, reward = {10,20215,0,}},	--3: 道具 
	{value = 3, reward = {10,20216,0,}},	--3: 道具 
	{value = 3, reward = {10,20217,0,}},	--3: 道具 
	{value = 3, reward = {10,20218,0,}},	--3: 道具 毒气
	{value = 3, reward = {10,20219,0,}},	--3: 道具 灭火器
}

--装备（普通3）
_tab_droppool["Equip_Normal3"] = {
	totalValue = 220,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20301,0,}},	--3: 道具 水晶雷达Ⅲ
	{value = 10, reward = {10,20302,0,}},	--3: 道具 装填电机Ⅲ
	{value = 10, reward = {10,20303,0,}},	--3: 道具 刀片轮毂Ⅲ
	{value = 10, reward = {10,20304,0,}},	--3: 道具 反应装甲Ⅲ
	{value = 10, reward = {10,20305,0,}},	--3: 道具 涡轮引擎Ⅲ
	{value = 10, reward = {10,20306,0,}},	--3: 道具 合金装甲Ⅲ
	{value = 10, reward = {10,20307,0,}},	--3: 道具 防火装甲Ⅲ
	{value = 10, reward = {10,20308,0,}},	--3: 道具 防电装甲Ⅲ
	{value = 10, reward = {10,20309,0,}},	--3: 道具 防毒装甲Ⅲ
	{value = 10, reward = {10,20310,0,}},	--3: 道具 修理装置Ⅲ
	{value = 10, reward = {10,20311,0,}},	--3: 道具 输弹机Ⅲ
	{value = 10, reward = {10,20312,0,}},	--3: 道具 布雷
	{value = 10, reward = {10,20313,0,}},	--3: 道具
	{value = 10, reward = {10,20314,0,}},	--3: 道具
	{value = 10, reward = {10,20315,0,}},	--3: 道具
	{value = 10, reward = {10,20316,0,}},	--3: 道具
	{value = 10, reward = {10,20317,0,}},	--3: 道具
	{value = 10, reward = {10,20318,0,}},	--3: 道具
	{value = 10, reward = {10,20319,0,}},	--3: 毒瘴
	{value = 10, reward = {10,20320,0,}},	--3: 声波
	{value = 10, reward = {10,20321,0,}},	--3: 毒液轮
	{value = 10, reward = {10,20322,0,}},	--3: 灭火器
}




--装备（高级）
_tab_droppool["Equip_High"] = {
	totalValue = 200,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20400,0,}},	--3: 道具 破碎星屑
	{value = 10, reward = {10,20401,0,}},	--3: 道具 光幕
	{value = 10, reward = {10,20402,0,}},	--3: 道具 原子切割
	{value = 10, reward = {10,20403,0,}},	--3: 道具 艾德曼合金装甲
	{value = 10, reward = {10,20404,0,}},	--3: 道具 艾德曼合金轮毂
	{value = 10, reward = {10,20405,0,}},	--3: 道具 骤雨
	{value = 10, reward = {10,20406,0,}},	--3: 道具 聚能炮
	{value = 10, reward = {10,20407,0,}},	--3: 道具 火箭发射器
	{value = 10, reward = {10,20408,0,}},	--3: 道具 全频超载装置
	{value = 10, reward = {10,20409,0,}},	--3: 道具 布雷机
	{value = 10, reward = {10,20410,0,}},	--3: 道具 绝对零度
	{value = 10, reward = {10,20411,0,}},	--3: 道具 量子玫瑰
	{value = 10, reward = {10,20412,0,}},	--3: 道具 超新星
	{value = 10, reward = {10,20413,0,}},	--3: 道具 震荡波
	{value = 10, reward = {10,20414,0,}},	--3: 道具 极光
	{value = 10, reward = {10,20415,0,}},	--3: 道具 奇美拉
	{value = 10, reward = {10,20416,0,}},	--3: 道具 瘟疫使者
	{value = 10, reward = {10,20417,0,}},	--3: 道具 次声波炸弹
	{value = 10, reward = {10,20418,0,}},	--3: 道具 风火轮
	{value = 10, reward = {10,20419,0,}},	--3: 道具 灭火器
	{value = 10, reward = {10,20420,0,}},	--3: 道具 自动爆破机
}

--芯片池子（挖矿）
_tab_droppool["Chip_Wakuang"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 70, reward = {11,1}},		--11: 芯片
	{value = 30, reward = {108,1}},		--108: 装备宝箱
}
