--用于界面显示成就的排序
hVar.tab_medalEx =
{
	11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,
	51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,
	101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,
}
	
	
	----奖励种类
	--SCORE = 1,			--1:积分
	--TACTIC = 2,			--2:战术卡
	--EQUIPITEM = 3,		--3:道具
	--HEROCARD = 4,			--4:英雄
	--HERODEBRIS = 5,		--5:英雄将魂
	--TACTICDEBRIS = 6,		--6:战术卡碎片
	--ONLINECOIN = 7,		--7:游戏币
	--NETCHEST = 8,			--8:网络宝箱
	--DRAWCARD = 9,			--9:战术卡卡包
	--REDEQUIP = 10,		--10:红色神器
	--CRYSTAL = 11,			--11:锻造材料
	--REDSCROLL = 12,		--12:红装兑换券
	--NETDRAWCARD = 13,		--13:服务器下发的抽卡类卡包
	--HEROEXP = 14,			--14:英雄经验
	--LUCKYREDCHEST = 15,		--15:幸运神器锦囊
	--IRON = 16,			--16:铁
	--WOOD = 17,			--17:木材
	--FOOD = 18,			--18:粮食
					--19:军团币
	--GROUPCOIN = 20,	
	--SCIENTIST_CHEST = 109,	--109:科学家宝箱
	--REWARD_MAXNUM = 109,		--定义奖励类型最大值
	--TOWERADDONESFREE = 21,	--21:强化免费券
	--TREASUREDEBRIS = 22,		--22:宝物碎片
	--CANGBAOTU_NORMAL = 23,	--23:藏宝图
	--CANGBAOTU_HIGH = 24,		--24:高级藏宝图
	--PVPCOIN = 25,			--25:兵符
	--CHOUJIANG_FREETICKET = 26,	--26:抽奖免费券
	----战车新加奖励类型
	--TASK_STONE = 100,		--100:任务之石
	--WEAPONGUN_DEBRIS = 101,	--101:武器枪碎片
	--PET_DEBRIS = 103,		--103:宠物碎片
	--SCIENTIST_DEBRIS = 104,	--104:科学家碎片
	--WEAPONGUN_CHEST = 105,	--105:武器枪宝箱
	--TACTIC_CHEST = 106,		--106:战术卡宝箱
	--PET_CHEST = 107,		--107:宠物宝箱
	--EQUIP_CHEST = 108,		--108:装备宝箱
	--SCIENTIST_CHEST = 109,		--109:科学家宝箱
	--SCIENTIST_ACHEVEMENT1 = 110,	--110:科学家成就1
	--SCIENTIST_ACHEVEMENT2 = 111,	--111:科学家成就2
	--SCIENTIST_ACHEVEMENT3 = 112,	--112:科学家成就3
	--SCIENTIST_ACHEVEMENT4 = 113,	--113:科学家成就4
	--DISHU_COIN = 114,		--114:地鼠币
	--TANKDEEADTH_ACHEVEMENT1 = 115,	--115:垃圾堆成就1
	--TANKDEEADTH_ACHEVEMENT2 = 116,	--116:垃圾堆成就2
	--TANKDEEADTH_ACHEVEMENT3 = 117,	--117:垃圾堆成就3
	--TANKDEEADTH_ACHEVEMENT4 = 118,	--118:垃圾堆成就4
	--TANKDEEADTH_ACHEVEMENT5 = 119,	--118:垃圾堆成就5



hVar.tab_medal = {}
local _tab_medal = hVar.tab_medal
--_tab_medal[0] = {
--	icon = "ICON:Imperial_Academy",
--	accumulate = 0,
--	conditions = {
--		--地图通关信息
--		[hVar.MEDAL_TYPE.map] = "world/td_001_yxcs",						--过第N关
--		[hVar.MEDAL_TYPE.gameTimesNormal] = 2,							--累计完成N个普通游戏局
--		[hVar.MEDAL_TYPE.gameTimesDiff1] = 2,							--累计完成N个挑战1游戏局
--		[hVar.MEDAL_TYPE.gameTimesDiff2] = 2,							--累计完成N个挑战2游戏局
--		[hVar.MEDAL_TYPE.gameTimesDiff3] = 2,							--累计完成N个挑战3游戏局
--		[hVar.MEDAL_TYPE.gameTimesDiff] = 2,							--累计完成N个挑战游戏局
--		[hVar.MEDAL_TYPE.gameTimes] = 2,							--累计完成N个游戏局
--		[hVar.MEDAL_TYPE.starCount] = 2,							--累计获得N个星
--		[hVar.MEDAL_TYPE.allStarNormal] = 2,							--满星通关N次普通
--		[hVar.MEDAL_TYPE.allStarDiff1] = 2,							--满星通关N次挑战1
--		[hVar.MEDAL_TYPE.allStarDiff2] = 2,							--满星通关N次挑战2
--		[hVar.MEDAL_TYPE.allStarDiff3] = 2,							--满星通关N次挑战3
--		[hVar.MEDAL_TYPE.allStarDiff] = 2,							--满星通关N次挑战
--		[hVar.MEDAL_TYPE.allStar] = 2,								--满星通关N次关卡
--		[hVar.MEDAL_TYPE.gameFailed] = 2,							--游戏失败次数
--		[hVar.MEDAL_TYPE.td_wj_001] = 1000,							--无尽关卡1战绩*
--		[hVar.MEDAL_TYPE.td_wj_002] = 3000,							--无尽关卡2战绩*
--
--		--击杀信息
--		[hVar.MEDAL_TYPE.killU] = 2,								--累计击杀N个敌人
--		[hVar.MEDAL_TYPE.killUB] = 7,								--累计击杀N个BOSS
--		[hVar.MEDAL_TYPE.killUT] = {14001, 7},							--累计击杀N个指定敌人
--		[hVar.MEDAL_TYPE.killUS] = {1105, 7},							--使用战术技能技能累计击杀N个敌人(tab_tacticId, num)
--
--		--升级信息
--		[hVar.MEDAL_TYPE.sLvUp] = 7,								--累计升级英雄技能N次
--		[hVar.MEDAL_TYPE.heroN] = 12,								--累计收集N个英雄
--		[hVar.MEDAL_TYPE.mergeN] = 13,								--累计合成N次
--		[hVar.MEDAL_TYPE.xilianN] = 14,								--累计洗练N次
--		[hVar.MEDAL_TYPE.rebuidlN] = 3,								--累计重铸N次
--		[hVar.MEDAL_TYPE.tLvUp] = 14,								--累计升级卡牌N次
--		[hVar.MEDAL_TYPE.tacticNum] = 15,							--累计收集N张战术卡
--
--		--消费信息
--		{hVar.MEDAL_TYPE.deposit] = 3000,							--累计充值XXX
--		--[hVar.MEDAL_TYPE.scoreCost] = 3000,							--累计花费积分XXX(暂无)
--		--{hVar.MEDAL_TYPE.rmbCost] = 300,							--累计花费金币XXX(暂无)
--		[hVar.MEDAL_TYPE.openChest] = 29,							--累计开N个宝箱
--		[hVar.MEDAL_TYPE.rollTactic] = 30,							--累计抽N张卡
--
--		--局内建造信息
--		[hVar.MEDAL_TYPE.buildT] = 30,								--累计建造N个塔
--		[hVar.MEDAL_TYPE.buildTT] = {hVar.UNIT_TAG_TYPE.TOWER.TAG_JIANTA, 30},			--累计建造N个塔(箭塔，炮塔，法术塔，毒塔，连弩塔，狙击塔，巨炮塔，地震塔，滚石塔，火塔，电塔，冰塔)
--		[hVar.MEDAL_TYPE.buildS] = 30,								--累计升级科技N次
--
--		--任务相关
--		[hVar.MEDAL_TYPE.apNum] = 30,								--累计获得N个成就点(achievement point)
--		[hVar.MEDAL_TYPE.missionN] = 30,							--累计完成N个任务
--
--	},
--	reward = {											--星级奖励:1积分,2战术技能卡,3道具,4英雄,5将魂,6战术技能卡碎片
--		{1,1000,},										--
--		{2,1000,1,2,},										--类型,ID,数量,等级
--		{3,8996,4},										--类型,ID,道具,属性价值倍率
--		{4,5000,1,1},										--类型,ID(道具id),星级（默认为1）,等级（默认为1，慎用）
--		{5,10201,1},										--类型,ID(道具id),数量
--		{6,10300,1},										--类型,ID(道具id),数量
--	},
--}


--星星1
_tab_medal[11] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 1,		--累计获得N个星
	},
	ap = 10,		--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15002,1,},
	},
}

--星星2
_tab_medal[12] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 3,		--累计获得N个星
	},
	ap = 10,		--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15002,3,},
	},
}

--星星3
_tab_medal[13] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 5,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15002,5,},
	},
}

--星星4
_tab_medal[14] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 10,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15002,7,},
	},
}

--星星5
_tab_medal[15] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 20,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{11,10,},
	},
}

--星星6
_tab_medal[16] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 30,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15002,12,},
	},
}

--星星7
_tab_medal[17] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 40,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15002,15,},
	},
}


--星星8
_tab_medal[18] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 50,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{10,20304,2},
	},
}


--星星9
_tab_medal[19] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 60,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{11,20,},
	},
}


--星星10
_tab_medal[20] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 70,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,25,},
	},
}


--星星11
_tab_medal[21] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 80,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{11,30,},
	},
}


--星星12
_tab_medal[22] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 90,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,35,},
	},
}

--星星13
_tab_medal[23] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 100,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{10,20317,3},
	},
}


--星星14
_tab_medal[24] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 110,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,40,},
	},
}

--星星15
_tab_medal[25] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 120,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,45,},
	},
}


--星星16
_tab_medal[26] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 130,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{11,50,},
	},
}

--星星17
_tab_medal[27] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 140,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,55,},
	},
}

--星星18
_tab_medal[28] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 150,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,60,},
	},
}


--星星19
_tab_medal[29] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 160,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,65,},
	},
}


--星星20
_tab_medal[30] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 180,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{10,20418,3},
	},
}



--星星21
_tab_medal[31] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 200,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,70,},
	},
}



--星星22
_tab_medal[32] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 220,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,75,},
	},
}



--星星23
_tab_medal[33] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 240,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,80,},
	},
}



--星星24
_tab_medal[34] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 260,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{107,85,},
	},
}


--星星25
_tab_medal[35] = {
	icon = "misc/task/task_000.png",
	icon_sub = "misc/addition/star_light2.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.starCount] = 280,		--累计获得N个星
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{10,20403,3},
	},
}






------------------------------------------------------------------------------------------------------------------
--科学家1
_tab_medal[51] = {
	icon = "misc/task/task_011.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 3,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,1,},
	},
}

--科学家2
_tab_medal[52] = {
	icon = "misc/task/task_010.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 5,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,3,},
	},
}

--科学家3
_tab_medal[53] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 10,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,5,},
	},
}

--科学家4
_tab_medal[54] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 15,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,7,},
	},
}

--科学家5
_tab_medal[55] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 20,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{11,10,},
	},
}

--科学家6
_tab_medal[56] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 30,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,12,},
	},
}

--科学家7
_tab_medal[57] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 40,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,15,},
	},
}

--科学家8
_tab_medal[58] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 50,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15102,20,},
		{110,1,},
	},
}


--科学家9
_tab_medal[59] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 60,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,20,},
	},
}

--科学家10
_tab_medal[60] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 70,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,20,},
	},
}

--科学家11
_tab_medal[61] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 80,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,25,},
	},
}

--科学家12
_tab_medal[62] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 90,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,25,},
	},
}

--科学家13
_tab_medal[63] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 100,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,30,},
	},
}

--科学家14
_tab_medal[64] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 120,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,30,},
	},
}

--科学家15
_tab_medal[65] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 137,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15102,30,},
		{111,1,},
	},
}

--科学家16
_tab_medal[66] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 150,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,35,},
	},
}

--科学家17
_tab_medal[67] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 170,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,40,},
	},
}


--科学家18
_tab_medal[68] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 200,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,40,},
	},
}

--科学家19
_tab_medal[69] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 230,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,50,},
	},
}


--科学家20
_tab_medal[70] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 260,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,50,},
	},
}


--科学家21
_tab_medal[71] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 300,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15102,60,},
		{112,1,},
	},
}


--科学家22
_tab_medal[72] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 350,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,60,},
	},
}


--科学家23
_tab_medal[73] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 400,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,70,},
	},
}


--科学家24
_tab_medal[74] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 450,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,70,},
	},
}


--科学家25
_tab_medal[75] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 500,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,80,},
	},
}


--科学家26
_tab_medal[76] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 550,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{105,90,},
	},
}


--科学家27
_tab_medal[77] = {
	icon = "misc/task/task_009.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.rescueScientist] = 616,		--累计拯救科学家数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15102,100,},
		{113,1,},
	},
}










------------------------------------------------------------------------------------------------------------------
--垃圾场1
_tab_medal[101] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 3,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,1,},
	},
}

--垃圾场2
_tab_medal[102] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 5,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,3,},
	},
}

--垃圾场3
_tab_medal[103] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 10,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,5,},
	},
}

--垃圾场4
_tab_medal[104] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 15,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,7,},
	},
}

--垃圾场5
_tab_medal[105] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 20,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{11,10,},
		{115,1,},
	},
}

--垃圾场6
_tab_medal[106] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 30,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,12,},
	},
}

--垃圾场7
_tab_medal[107] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 40,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{101,15001,15,},
	},
}

--垃圾场8
_tab_medal[108] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 50,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15101,20,},
		{116,1,},
	},
}


--垃圾场9
_tab_medal[109] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 60,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,20,},
	},
}

--垃圾场10
_tab_medal[110] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 70,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,30,},
	},
}

--垃圾场11
_tab_medal[111] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 80,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,40,},
	},
}

--垃圾场12
_tab_medal[112] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 90,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,50,},
	},
}

--垃圾场13
_tab_medal[113] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 100,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15101,30,},
		{117,1,},
	},
}

--垃圾场14
_tab_medal[114] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 110,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,60,},
	},
}

--垃圾场15
_tab_medal[115] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 120,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,70,},
	},
}

--垃圾场16
_tab_medal[116] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 130,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,80,},
	},
}

--垃圾场17
_tab_medal[117] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 140,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,90,},
	},
}

--垃圾场18
_tab_medal[118] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 160,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,100,},
	},
}

--垃圾场19
_tab_medal[119] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 180,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,110,},
	},
}

--垃圾场20
_tab_medal[120] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 200,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15101,60,},
		{118,1,},
	},
}

--垃圾场21
_tab_medal[121] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 220,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,120,},
	},
}

--垃圾场22
_tab_medal[122] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 240,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,130,},
	},
}

--垃圾场23
_tab_medal[123] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 260,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,140,},
	},
}

--垃圾场24
_tab_medal[124] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 280,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{108,150,},
	},
}

--垃圾场25
_tab_medal[125] = {
	icon = "misc/task/task_012.png",
	width = 97,
	height = 65,
	conditions = {
		[hVar.MEDAL_TYPE.tankDeadthCount] = 300,		--累计战车死亡数量
	},
	ap = 10,	--成就点
	reward = {	--星级奖励:(1:积分 / 2:战术技能卡 / 3:道具 / 4:英雄 / 5:英雄将魂 / 6:战术技能卡碎片 / 7:游戏币 / 8:网络宝箱 / 9:抽奖类战术技能卡 / 10:神器 / 11:神器晶石 / 12:红装兑换券 / 13:服务器抽卡 / 14:英雄经验卡 / 15:直接开锦囊 / 16:铁 / 17:木材 / 18:粮食 / 20:军团币 / 21:强化免费券 / 22:宝物碎片 / 23:藏宝图碎片 / 24:高级藏宝图碎片 / 25:兵符 / 26:抽奖免费券 / 27:战功积分 / 28:成就点)
		{103,15101,100,},
		{119,1,},
	},
}
