hVar.tab_droppool = {}

local _tab_droppool = hVar.tab_droppool




--武器枪碎片（普通）
_tab_droppool["Weapon_Normal"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {101,15001,1,}},	--101: 武器枪碎片 普通机枪碎片
	{value = 10, reward = {101,15002,1,}},	--101: 武器枪碎片 散弹枪碎片
	{value = 10, reward = {101,15003,1,}},	--101: 武器枪碎片 弹射枪碎片
	{value = 10, reward = {101,15004,1,}},	--101: 武器枪碎片 火焰枪碎片
	{value = 10, reward = {101,15005,1,}},	--101: 武器枪碎片 射线枪碎片
	{value = 10, reward = {101,15006,1,}},	--101: 武器枪碎片 闪电枪碎片
	{value = 10, reward = {101,15007,1,}},	--101: 武器枪碎片 毒液枪碎片
	{value = 10, reward = {101,15008,1,}},	--101: 武器枪碎片 缩小枪碎片
	{value = 10, reward = {101,15009,1,}},	--101: 武器枪碎片 镭射枪碎片
	{value = 10, reward = {101,15010,1,}},	--101: 武器枪碎片 冲击枪碎片
}

--[[
--武器枪碎片（高级）
_tab_droppool["Weapon_High"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	--{value = 20, reward = {101,15001,1,}},	--101: 武器枪碎片 普通机枪碎片
	--{value = 20, reward = {101,15002,1,}},	--101: 武器枪碎片 散弹枪碎片
	--{value = 20, reward = {101,15003,1,}},	--101: 武器枪碎片 弹射枪碎片
	{value = 40, reward = {101,15004,1,}},	--101: 武器枪碎片 火焰枪碎片
	{value = 20, reward = {101,15005,1,}},	--101: 武器枪碎片 射线枪碎片
	{value = 20, reward = {101,15006,1,}},	--101: 武器枪碎片 闪电枪碎片
	{value = 5, reward = {101,15007,1,}},	--101: 武器枪碎片 毒液枪碎片
	{value = 5, reward = {101,15008,1,}},	--101: 武器枪碎片 缩小枪碎片
	{value = 5, reward = {101,15009,1,}},	--101: 武器枪碎片 镭射枪碎片
	{value = 5, reward = {101,15010,1,}},	--101: 武器枪碎片 冲击枪碎片
}
]]

--战术卡碎片（普通）
_tab_droppool["Tactic_Normal"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 5, reward = {6,15201,1,}},	--6: 战术卡碎片 核爆碎片
	{value = 10, reward = {6,15202,1,}},	--6: 战术卡碎片 召唤机枪塔碎片
	{value = 10, reward = {6,15203,1,}},	--6: 战术卡碎片 召唤导弹塔碎片
	{value = 5, reward = {6,15204,1,}},	--6: 战术卡碎片 追踪导弹碎片
	{value = 5, reward = {6,15205,1,}},	--6: 战术卡碎片 护盾碎片
	{value = 10, reward = {6,15206,1,}},	--6: 战术卡碎片 十字炸弹碎片
	{value = 10, reward = {6,15207,1,}},	--6: 战术卡碎片 卫星炮碎片
	{value = 10, reward = {6,15208,1,}},	--6: 战术卡碎片 缩小碎片
	{value = 5, reward = {6,15209,1,}},	--6: 战术卡碎片 延时炸弹碎片
	{value = 5, reward = {6,15210,1,}},	--6: 战术卡碎片 冰冻碎片
	{value = 5, reward = {6,15211,1,}},	--6: 战术卡碎片 弹射球碎片
	{value = 10, reward = {6,15212,1,}},	--6: 战术卡碎片 黑洞碎片
	{value = 10, reward = {6,15213,1,}},	--6: 战术卡碎片 巨浪碎片
}

--[[
--战术卡碎片（普通）
_tab_droppool["Tactic_High"] = {
	totalValue = 95,			--总权重(后续所有权重和一定要等于总权重)
	{value = 5, reward = {6,15201,1,}},	--6: 战术卡碎片 核爆碎片
	{value = 5, reward = {6,15202,1,}},	--6: 战术卡碎片 召唤机枪塔碎片
	{value = 5, reward = {6,15203,1,}},	--6: 战术卡碎片 召唤导弹塔碎片
	{value = 5, reward = {6,15204,1,}},	--6: 战术卡碎片 追踪导弹碎片
	{value = 5, reward = {6,15205,1,}},	--6: 战术卡碎片 护盾碎片
	{value = 5, reward = {6,15206,1,}},	--6: 战术卡碎片 十字炸弹碎片
	{value = 5, reward = {6,15207,1,}},	--6: 战术卡碎片 卫星炮碎片
	{value = 10, reward = {6,15208,1,}},	--6: 战术卡碎片 缩小碎片
	{value = 10, reward = {6,15209,1,}},	--6: 战术卡碎片 延时炸弹碎片
	{value = 10, reward = {6,15210,1,}},	--6: 战术卡碎片 冰冻碎片
	{value = 10, reward = {6,15211,1,}},	--6: 战术卡碎片 弹射球碎片
	{value = 10, reward = {6,15212,1,}},	--6: 战术卡碎片 黑洞碎片
	{value = 10, reward = {6,15213,1,}},	--6: 战术卡碎片 巨浪碎片
}
]]


--宠物碎片（普通）
_tab_droppool["Pet_Normal"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 35, reward = {103,15101,1,}},	--103: 宠物碎片 瓦力宠物碎片
	{value = 35, reward = {103,15102,1,}},	--103: 宠物碎片 尤达宠物碎片
	{value = 15, reward = {103,15103,1,}},	--103: 宠物碎片 支援战机宠物碎片
	{value = 15, reward = {103,15104,1,}},	--103: 宠物碎片 刺蛇宝宝宠物碎片
}

--[[
--宠物碎片（高级）
_tab_droppool["Pet_High"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 30, reward = {103,15101,1,}},	--103: 宠物碎片 瓦力宠物碎片
	{value = 30, reward = {103,15102,1,}},	--103: 宠物碎片 尤达宠物碎片
	{value = 20, reward = {103,15103,1,}},	--103: 宠物碎片 支援战机宠物碎片
	{value = 20, reward = {103,15104,1,}},	--103: 宠物碎片 刺蛇宝宝宠物碎片
}
]]

--装备（普通1）
_tab_droppool["Equip_Normal"] = {
	totalValue = 143,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20101,0,}},	--3: 道具 水晶雷达Ⅰ
	{value = 10, reward = {10,20102,0,}},	--3: 道具 装填电机Ⅰ
	{value = 10, reward = {10,20103,0,}},	--3: 道具 刀片轮毂Ⅰ
	{value = 10, reward = {10,20104,0,}},	--3: 道具 反应装甲Ⅰ
	{value = 10, reward = {10,20105,0,}},	--3: 道具 涡轮引擎Ⅰ
	{value = 10, reward = {10,20106,0,}},	--3: 道具 合金装甲Ⅰ
	{value = 10, reward = {10,20107,0,}},	--3: 道具 防火装甲Ⅰ
	{value = 10, reward = {10,20108,0,}},	--3: 道具 防电装甲Ⅰ
	{value = 10, reward = {10,20109,0,}},	--3: 道具 防毒装甲Ⅰ
	{value = 10, reward = {10,20110,0,}},	--3: 道具 修理装置Ⅰ
	{value = 10, reward = {10,20211,0,}},	--3: 道具 输弹机Ⅰ
	{value = 3, reward = {10,20121,0,}},	
	{value = 3, reward = {10,20122,0,}},
	{value = 3, reward = {10,20123,0,}},
	{value = 3, reward = {10,20124,0,}},
	{value = 3, reward = {10,20125,0,}},
	{value = 3, reward = {10,20126,0,}},
	{value = 3, reward = {10,20127,0,}},
	{value = 3, reward = {10,20128,0,}},
	{value = 3, reward = {10,20129,0,}},
	{value = 3, reward = {10,20130,0,}},
	{value = 3, reward = {10,20131,0,}},
}

--装备（普通2）
_tab_droppool["Equip_Normal2"] = {
	totalValue = 128,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20201,0,}},	--3: 道具 水晶雷达Ⅱ
	{value = 10, reward = {10,20202,0,}},	--3: 道具 装填电机Ⅱ
	{value = 10, reward = {10,20203,0,}},	--3: 道具 刀片轮毂Ⅱ
	{value = 10, reward = {10,20204,0,}},	--3: 道具 反应装甲Ⅱ
	{value = 10, reward = {10,20205,0,}},	--3: 道具 涡轮引擎Ⅱ
	{value = 10, reward = {10,20206,0,}},	--3: 道具 合金装甲Ⅱ
	{value = 10, reward = {10,20207,0,}},	--3: 道具 防火装甲Ⅱ
	{value = 10, reward = {10,20208,0,}},	--3: 道具 防电装甲Ⅱ
	{value = 10, reward = {10,20209,0,}},	--3: 道具 防毒装甲Ⅱ
	{value = 10, reward = {10,20210,0,}},	--3: 道具 修理装置Ⅱ
	{value = 10, reward = {10,20211,0,}},	--3: 道具 输弹机Ⅱ
	{value = 3, reward = {10,20214,0,}},	--3: 道具 
	{value = 3, reward = {10,20215,0,}},	--3: 道具 
	{value = 3, reward = {10,20216,0,}},	--3: 道具 
	{value = 3, reward = {10,20217,0,}},	--3: 道具 
	{value = 3, reward = {10,20218,0,}},	--3: 道具 毒气
	{value = 3, reward = {10,20219,0,}},	--3: 道具 灭火器
}

--装备（普通3）
_tab_droppool["Equip_Normal3"] = {
	totalValue = 220,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20301,0,}},	--3: 道具 水晶雷达Ⅲ
	{value = 10, reward = {10,20302,0,}},	--3: 道具 装填电机Ⅲ
	{value = 10, reward = {10,20303,0,}},	--3: 道具 刀片轮毂Ⅲ
	{value = 10, reward = {10,20304,0,}},	--3: 道具 反应装甲Ⅲ
	{value = 10, reward = {10,20305,0,}},	--3: 道具 涡轮引擎Ⅲ
	{value = 10, reward = {10,20306,0,}},	--3: 道具 合金装甲Ⅲ
	{value = 10, reward = {10,20307,0,}},	--3: 道具 防火装甲Ⅲ
	{value = 10, reward = {10,20308,0,}},	--3: 道具 防电装甲Ⅲ
	{value = 10, reward = {10,20309,0,}},	--3: 道具 防毒装甲Ⅲ
	{value = 10, reward = {10,20310,0,}},	--3: 道具 修理装置Ⅲ
	{value = 10, reward = {10,20311,0,}},	--3: 道具 输弹机Ⅲ
	{value = 10, reward = {10,20312,0,}},	--3: 道具 布雷
	{value = 10, reward = {10,20313,0,}},	--3: 道具
	{value = 10, reward = {10,20314,0,}},	--3: 道具
	{value = 10, reward = {10,20315,0,}},	--3: 道具
	{value = 10, reward = {10,20316,0,}},	--3: 道具
	{value = 10, reward = {10,20317,0,}},	--3: 道具
	{value = 10, reward = {10,20318,0,}},	--3: 道具
	{value = 10, reward = {10,20319,0,}},	--3: 毒瘴
	{value = 10, reward = {10,20320,0,}},	--3: 声波
	{value = 10, reward = {10,20321,0,}},	--3: 毒液轮
	{value = 10, reward = {10,20322,0,}},	--3: 灭火器
}




--装备（普通宝箱）
_tab_droppool["Equip_High1"] = {
	totalValue = 140,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20400,0,}},	--3: 道具 破碎星屑
	--{value = 10, reward = {10,20401,0,}},	--3: 道具 光幕
	{value = 10, reward = {10,20402,0,}},	--3: 道具 原子切割
	{value = 10, reward = {10,20403,0,}},	--3: 道具 艾德曼合金装甲
	{value = 10, reward = {10,20404,0,}},	--3: 道具 艾德曼合金轮毂
	{value = 10, reward = {10,20405,0,}},	--3: 道具 骤雨
	--{value = 10, reward = {10,20406,0,}},	--3: 道具 猩红闪电
	--{value = 10, reward = {10,20407,0,}},	--3: 道具 地狱火
	--{value = 10, reward = {10,20408,0,}},	--3: 道具 全频超载装置
	{value = 10, reward = {10,20409,0,}},	--3: 道具 布雷机
	--{value = 10, reward = {10,20410,0,}},	--3: 道具 绝对零度
	--{value = 10, reward = {10,20411,0,}},	--3: 道具 量子玫瑰
	{value = 10, reward = {10,20412,0,}},	--3: 道具 超新星
	{value = 10, reward = {10,20413,0,}},	--3: 道具 震荡波
	{value = 10, reward = {10,20414,0,}},	--3: 道具 极光
	{value = 10, reward = {10,20415,0,}},	--3: 道具 奇美拉
	--{value = 10, reward = {10,20416,0,}},	--3: 道具 瘟疫使者
	{value = 10, reward = {10,20417,0,}},	--3: 道具 次声波炸弹
	{value = 10, reward = {10,20418,0,}},	--3: 道具 风火轮
	{value = 10, reward = {10,20419,0,}},	--3: 道具 灭火器
	{value = 10, reward = {10,20420,0,}},	--3: 道具 自动爆破机
}


--装备（神器宝箱）
_tab_droppool["Equip_High2"] = {
	totalValue = 220,			--总权重(后续所有权重和一定要等于总权重)
	{value = 10, reward = {10,20400,0,}},	--3: 道具 破碎星屑
	{value = 10, reward = {10,20401,0,}},	--3: 道具 光幕
	{value = 10, reward = {10,20402,0,}},	--3: 道具 原子切割
	{value = 10, reward = {10,20403,0,}},	--3: 道具 艾德曼合金装甲
	{value = 10, reward = {10,20404,0,}},	--3: 道具 艾德曼合金轮毂
	{value = 10, reward = {10,20405,0,}},	--3: 道具 骤雨
	{value = 10, reward = {10,20406,0,}},	--3: 道具 猩红闪电
	{value = 10, reward = {10,20407,0,}},	--3: 道具 地狱火
	{value = 10, reward = {10,20408,0,}},	--3: 道具 全频超载装置
	{value = 10, reward = {10,20409,0,}},	--3: 道具 布雷机
	{value = 10, reward = {10,20410,0,}},	--3: 道具 绝对零度
	{value = 10, reward = {10,20411,0,}},	--3: 道具 量子玫瑰
	{value = 10, reward = {10,20412,0,}},	--3: 道具 超新星
	{value = 10, reward = {10,20413,0,}},	--3: 道具 震荡波
	{value = 10, reward = {10,20414,0,}},	--3: 道具 极光
	{value = 10, reward = {10,20415,0,}},	--3: 道具 奇美拉
	{value = 10, reward = {10,20416,0,}},	--3: 道具 瘟疫使者
	{value = 10, reward = {10,20417,0,}},	--3: 道具 次声波炸弹
	{value = 10, reward = {10,20418,0,}},	--3: 道具 风火轮
	{value = 10, reward = {10,20419,0,}},	--3: 道具 灭火器
	{value = 10, reward = {10,20420,0,}},	--3: 道具 自动爆破机
	{value = 10, reward = {10,20421,0,}},	--3: 道具 意智宝玉
	--{value = 10, reward = {10,20422,0,}},	--3: 道具 基因拟态酶
}



--芯片池子（挖矿）
_tab_droppool["Chip_Wakuang"] = {
	totalValue = 100,			--总权重(后续所有权重和一定要等于总权重)
	{value = 70, reward = {11,1}},		--11: 芯片
	{value = 30, reward = {108,1}},		--108: 装备宝箱
}
